---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
source: html/25683f55-98e6-852b-a7f2-85d1a9c2fede.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange

Defines parameters for I-shape Parallel Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionIParallelFlange : StructuralSectionGeneralI
```